Revit 2027 API
PipeFittingAndAccessoryPressureDropUIDataItem Methods
The PipeFittingAndAccessoryPressureDropUIDataItem type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetEntity |  Returns the entity set by UI server. or an invalid entity otherwise.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetPipeFittingAndAccessoryData |  Gets the fitting data stored in the UI data item.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetEntity |  Stores the entity in the UI data item.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
PipeFittingAndAccessoryPressureDropUIDataItem Class
Autodesk.Revit.UI.Plumbing Namespace